[
  {
    "title": "Sum Minimisation",
    "url": "https://codeforces.com/problemset/problem/2140/F",
    "description": " You are given an array aaa of size nnn, and you can perform the following operation on the array aaa any number of times (including zero):  Select any set of kkk distinct indices S={i1,i2,…,ik}S={i1,i2,…,ik}S = \\{i_1, i_2, \\ldots, i_k\\}, where 1≤ij≤n1≤ij≤n1 \\le i_j \\le n for all 1≤j≤k1≤j≤k1\\le j\\le k.  Compute the sum x=ai1+ai2+⋯+aikx=ai1+ai2+⋯+aikx = a_{i_1} + a_{i_2} + \\cdots + a_{i_k}, and set y=x−⌊xk⌋⋅ky=x−⌊xk⌋⋅ky = x - \\left\\lfloor \\frac{x}{k} \\right\\rfloor \\cdot k.  Among the selected elements ai1,…,aikai1,…,aika_{i_1}, \\ldots, a_{i_k}, decrease the yyy smallest values by 111.   If two elements have different values (ai≠ajai≠aja_i\\ne a_j), the one with the smaller value is smaller.  If two elements have the same value (ai=ajai=aja_i= a_j), the one with the smaller index is smaller.  If y=0y=0y=0, no element is decreased. Your task is to determine the minimum possible value of the sum of elements of the array aaa that can be achieved after performing the operation any number of times or report that it can be decreased indefinitely."
  },
  {
    "title": "Prime Gaming (Hard Version)",
    "url": "https://codeforces.com/problemset/problem/2140/E2",
    "description": "  This is the hard version of the problem. The difference between the versions is that in this version, m≤106m \\le 10^6. You can hack only if you solved all versions of this problem. A valid configuration is defined as an arrangement of nn piles of stones such that:  The number of stones in each pile is an integer between 11 and mm (both inclusive). Given a valid configuration of nn piles of stones, some indices from 11 to nn are marked as good. Alice and Bob start playing a game taking n−1n-1 turns alternately with Alice going first. In each turn, they have to perform the following operation:  Choose any integer ii such that 1≤i≤p1 \\le i \\le p (where pp is the number of piles left) and ii is good, and remove the ii-th pile completely. Note that after performing the operation once, the number of piles decreases by 11 and the remaining piles are re-indexed. The game will end when there is only one pile left. It is guaranteed that the index 11 is always good.Let xx denote the number of stones in the final remaining pile. Alice wants to maximize xx, whereas Bob wants to minimize it. Both Alice and Bob play optimally.Find the sum of xx over all the possible valid configurations modulo 109+710 ^ 9 + 7."
  },
  {
    "title": "Prime Gaming (Easy Version)",
    "url": "https://codeforces.com/problemset/problem/2140/E1",
    "description": "  This is the easy version of the problem. The difference between the versions is that in this version, m≤2m≤2m \\le 2. You can hack only if you solved all versions of this problem. A valid configuration is defined as an arrangement of nnn piles of stones such that:  The number of stones in each pile is an integer between 111 and mmm (both inclusive). Given a valid configuration of nnn piles of stones, some indices from 111 to nnn are marked as good. Alice and Bob start playing a game taking n−1n−1n-1 turns alternately with Alice going first. In each turn, they have to perform the following operation:  Choose any integer iii such that 1≤i≤p1≤i≤p1 \\le i \\le p (where ppp is the number of piles left) and iii is good, and remove the iii-th pile completely. Note that after performing the operation once, the number of piles decreases by 111 and the remaining piles are re-indexed. The game will end when there is only one pile left. It is guaranteed that the index 111 is always good.Let xxx denote the number of stones in the final remaining pile. Alice wants to maximize xxx, whereas Bob wants to minimize it. Both Alice and Bob play optimally.Find the sum of xxx over all the possible valid configurations modulo 109+7109+710 ^ 9 + 7."
  },
  {
    "title": "A Cruel Segment's Thesis",
    "url": "https://codeforces.com/problemset/problem/2140/D",
    "description": "You are given nnn segments on a number line. The iii-th segment is represented as [li,ri][li,ri][l_i, r_i]. Initially, all the segments are unmarked.You perform the following operation repeatedly until there are no unmarked segments left:   In the kkk-th operation, if there are at least two unmarked segments, choose any two unmarked segments [li,ri][li,ri][l_i, r_i] and [lj,rj][lj,rj][l_j, r_j], mark both of them, and add a new marked segment [xk,yk][xk,yk][x_k, y_k] satisfying the following conditions:   li≤xk≤rili≤xk≤ril_i \\leq x_k \\leq r_i,  lj≤yk≤rjlj≤yk≤rjl_j \\leq y_k \\leq r_j,  xk≤ykxk≤ykx_k \\leq y_k.  If there is exactly one unmarked segment remaining, mark it. Your task is to determine the maximum possible sum of lengths of all the marked segments at the end of the process. Note that the length of a segment ([l,r])([l,r])([l,r]) is r−lr−lr-l."
  },
  {
    "title": "Ultimate Value",
    "url": "https://codeforces.com/problemset/problem/2140/C",
    "description": " Let's define a function f(a)f(a) for an array aa of length nn as f(a)=cost+(a1−a2+a3−a4⋯an)f(a) = \\textrm{cost} + (a_1 - a_2 + a_3 - a_4 \\cdots a_n) where cost\\textrm{cost} is zero initially.Now consider the scenario where Alice and Bob are given an array aa of length nn. They play a game taking at most 1010010^{100} turns alternately with Alice going first.In each turn, they must perform any one (only one) of the following operations:   End the game for both Alice and Bob.  Choose two indices l,rl,r with 1≤l≤r≤n1 \\le l \\le r \\le n and swap ala_l and ara_r; this adds (r−l)(r - l) to the cost\\textrm{cost}. Assume that Alice tries to maximize f(a)f(a) and Bob tries to minimize it. Your task is to determine the final value of f(a)f(a) assuming both players play optimally."
  },
  {
    "title": "Vowels Game in a String",
    "url": "https://leetcode.com/problems/vowels-game-in-a-string?envType=daily-question&envId=2025-09-12",
    "description": "Alice and Bob are playing a game on a string. You are given a string s, Alice and Bob will take turns playing the following game where Alice starts first: The first player who cannot make a move on their turn loses the game. We assume that both Alice and Bob play optimally. Return true if Alice wins the game, and false otherwise. The English vowels are: a, e, i, o, and u."
  },
  {
    "title": "Two Sum",
    "url": "https://leetcode.com/problems/two-sum",
    "description": "Given an array of integers nums and an integer target, return indices of the two numbers such that they add up to target. You may assume that each input would have exactly one solution, and you may not use the same element twice. You can return the answer in any order."
  },
  {
    "title": "Add Two Numbers",
    "url": "https://leetcode.com/problems/add-two-numbers",
    "description": "You are given two non-empty linked lists representing two non-negative integers. The digits are stored in reverse order, and each of their nodes contains a single digit. Add the two numbers and return the sum as a linked list. You may assume the two numbers do not contain any leading zero, except the number 0 itself."
  },
  {
    "title": "Longest Substring Without Repeating Characters",
    "url": "https://leetcode.com/problems/longest-substring-without-repeating-characters",
    "description": "Given a string s, find the length of the longest substring without duplicate characters."
  },
  {
    "title": "Median of Two Sorted Arrays",
    "url": "https://leetcode.com/problems/median-of-two-sorted-arrays",
    "description": "Given two sorted arrays nums1 and nums2 of size m and n respectively, return the median of the two sorted arrays. The overall run time complexity should be O(log (m+n))."
  }
]